html/emacs_as_a_playground.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-26 Sat 11:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs as a playground</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Lato:ital,wght@0,400;0,700;1,400&display=swap" rel="stylesheet">
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<header>
    <script src="setup-initial-theme.js"></script>
    <nav style="display: flex; justify-content: space-between; align-items: center;">
        <a href="/" style="color: inherit; text-decoration: none;">ketan.me</a>
        <ul style="display: flex; list-style-type: none; padding: 0; margin: 0;">
            <li style="margin-left: 1rem;"><a href="/blog.html">blog</a></li>
            <li style="margin-left: 1rem;"><a href="/thoughts.html">thoughts</a></li>
            <li style="margin-left: 1rem;"><a href="/experiments.html">garden</a></li>
            <li style="margin-left: 1rem;"><input type="checkbox" id="theme-switcher">
                <label id="theme-switcher-label" for="theme-switcher"></label>
            </li>
        </ul>
    </nav>
</header>
</div>
<div id="content" class="content">
<h1 class="title">emacs as a playground
<br />
<span class="subtitle">Last tended to on October 13, 2024</span>
</h1>
<p>
i think emacs presents an alternative vision of an operating system. one in which &rsquo;apps&rsquo;—these siloes of functionality that are bundled together &amp; don&rsquo;t really talk to each other— are not the dominant abstraction. right now, on our desktops, we have separate apps for writing code, writing messages to people, writing essays&#x2026;.when fundamentally each of these tasks has to do with manipulating text.<br />
</p>
<div id="outline-container-org26a5273" class="outline-2">
<h2 id="org26a5273">emacs provides an powerful set of primitives for editing text</h2>
<div class="outline-text-2" id="text-org26a5273">
<p>
so, one reason i like emacs is that it provides an incredibly powerful set of primitives for editing text. these primitives are not just confined to the &rsquo;writing app&rsquo; or the &rsquo;coding app&rsquo; (though there is not really such a thing as an ‘app’ in emacs), but rather they are present throughout the whole system. kinda like how cmd-C and cmd-V work in every app, but generalized.<br />
</p>

<p>
examples:<br />
</p>

<p>
you have primitives for things like deleting, uppercasing, highlighting, jumping up and down, creating a new line, recording a sequence of actions and replaying those back later…all the things that would be useful when editing text. and each of these primitives can be applied dynamically to a range of characters<br />
</p>

<p>
but then, perhaps even cooler, is that these primitives are like LEGO blocks, or maybe more aptly described like Play-Doh. they can be molded, composed, replaced, or extended into anything the end-user.<br />
</p>

<ul class="org-ul">
<li>don&rsquo;t like the default keybindings? (like vim&rsquo;s better, as i do?) you can change them.<br /></li>
<li>you can set up a primitive that calls any external API, too. one example i like is github copilot, the AI code completion engine that i use. since everything in emacs is text, and copilot is an engine for text completion, by simply setting up copilot, we automagically get copilot in our code files, in our note files, in our terminal shell, and anywhere else we want it.<br /></li>
</ul>


<p>
<a href="compositionality.html#ID-b6fafba6-8e57-400d-962c-bf7cc892a41f">compositionality</a><br />
<a href="modularity.html#ID-87e83cf3-3dfa-4486-845d-155895a9f6b6">modularity</a><br />
<a href="private/20200228175006_decomposition.html#ID-650a6bb7-c7de-44ef-a328-ddc79a562a9e">decomposition</a><br />
</p>
</div>
</div>
<div id="outline-container-orgb4f2e54" class="outline-2">
<h2 id="orgb4f2e54">emacs is self-documenting</h2>
<div class="outline-text-2" id="text-orgb4f2e54">
<p>
similar to hit inspect in browsers, kinda &#x2013; except better<br />
</p>

<p>
it&rsquo;s self-documenting. you can hover over anything and figure out what it means. type in any keybind and figure out what it does.<br />
</p>

<p>
[screengrab of checking out what a given keybind does.]<br />
</p>
</div>
</div>
<div id="outline-container-org53839e7" class="outline-2">
<h2 id="org53839e7">the beauty of emacs lisp</h2>
<div class="outline-text-2" id="text-org53839e7">
<p>
emacs lisp, the language you extend emacs with, is quite a beautiful programming language. this is another topic for an entirely separate blog post. one weird and meta experience you can have— you can write, execute, and experience the effects of a snippet of code, even on that snippet itself, all in the same file.<br />
</p>
</div>
</div>
<div id="outline-container-orga662b22" class="outline-2">
<h2 id="orga662b22">limits of emacs</h2>
<div class="outline-text-2" id="text-orga662b22">
<p>
As to its limitations, there are many.<br />
</p>

<ul class="org-ul">
<li>to start, emacs is an archaic text editor, created in 1976, and it has essentially evolved directly from that lineage since then. because of that, it has some architectural baggage; it doesn’t do multi-threading, some things can be slow, and some features of elisp are rather arcane / don’t match modern programming patterns. the remote development experience is bad. etc.<br /></li>
<li>the learning curve is much, much higher than other editors like vscode. but then again, i’d argue emacs isn’t even the same type of thing as vscode…so maybe it’s appropriate that the learning curve is higher. that said, i think there are things they could do immediately that would mitigate this steep learning curve.<br /></li>
<li>it’s bad at doing anything that doesn’t strictly involve text. so when i say it’s an operating system, don’t take me super literally— it’s more of a vision of what an OS <b>could</b> be as opposed to a self-contained, fully-functional OS in its current state.<br /></li>
<li><p>
AI features still lacking &#x2013; for sure things that I prefer to use cursor for.<br />
</p>

<p>
so…back to the question at hand…how has emacs helped me? to be honest, i can’t say that it’s made me ‘more productive’ than my peers— quite the opposite sometimes, as it provides endless distractions and fun things to try out. org-mode has certainly helped me organize me life. but it’s helped me gain an appreciation for the above^, that software could feel more like a playground than strictly a siloed set of tools for getting specific things done. rather than having to go top-down and create a whole new app (starting with some annoying template like `create-react-app`), you can start bottom-up, and write a single line of elisp. that in itself is a functional and useful addition to emacs!<br />
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org7aad772" class="outline-2 references">
<h2 id="org7aad772">Links to &ldquo;emacs as a playground&rdquo;</h2>
<div class="outline-text-2" id="text-org7aad772">
</div>
<div id="outline-container-orgfe48e04" class="outline-3">
<h3 id="orgfe48e04"><a href="posts.html#ID-729f454a-3d66-44f4-bc6e-ec8a21a26ac9">posts</a></h3>
<div class="outline-text-3" id="text-orgfe48e04">
<p>
<a href="emacs_as_a_playground.html#ID-2e5f0c3e-ff4c-4e83-9e3f-758716d370b8">emacs as a playground</a><br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<!-- copyright Ketan agrawal - on line below-->
<p>&copy; Ketan Agrawal, 2024. <a href="https://x.com/_ketan0">@_ketan0</a>.</p>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js"></script>
<script src="setup-theme-switcher.js"></script>
<script src="insert-intext-citation.js"></script>
</div>
</body>
</html>
